Revit 2027 API
BuiltInFailures.SketchFailures.ManyCCWLoops Property
 Area defined by sketch must be connected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ManyCCWLoops { get; }
Public Shared ReadOnly Property ManyCCWLoops As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ManyCCWLoops {
	FailureDefinitionId^ get ();
}
static member ManyCCWLoops : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace